app/Views/dashboard/inventory_staff.php

SELECT *
FROM `categories`
WHERE `status` = 'active'
---
                                <select class="form-select" name="category_id" required>
                                    <option value="">— select category —</option>
                                    <?php if (!empty($products)): ?>
                                        <?php $db = db_connect(); $categories = $db->table('categories')->where('status', 'active')->get()->getResultArray(); ?>

SELECT *
FROM `suppliers`
WHERE `status` = 'active'
---
                                <select class="form-select" name="supplier_id" required>
                                    <option value="">— select supplier —</option>
                                    <?php if (!empty($products)): ?>
                                        <?php $suppliers = $db->table('suppliers')->where('status', 'active')->get()->getResultArray(); ?>