app/Controllers/Auth.php

    public function attemptLogin(): RedirectResponse
    {
        $loginInput = (string) $this->request->getPost('username');
        $password = (string) $this->request->getPost('password');

        if ($loginInput === '' || $password === '') {
            return redirect()->back()->with('error', 'Please enter username/email and password.');
        }

        $userModel = model('App\\Models\\UserModel');

        // Check if login is email or username
        if (filter_var($loginInput, FILTER_VALIDATE_EMAIL)) {
            $user = $userModel->where('email', $loginInput)->first();
        } else {
            $user = $userModel->where('username', $loginInput)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'branch2@chakanoks.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `username` = 'franchise.mgr'
 LIMIT 1

        } else {
            // For other roles, get branch info
            $db = \Config\Database::connect();
            $branch = $db->table('user_branches ub')
                ->select('b.branch_id, b.branch_name, b.manager_name')
                ->join('branches b', 'b.branch_id = ub.branch_id')
                ->where('ub.user_id', $user['user_id'])
                ->orderBy('ub.user_branch_id', 'ASC')
                ->get()
                ->getRowArray();
---
SELECT `b`.`branch_id`, `b`.`branch_name`, `b`.`manager_name`
FROM `user_branches` `ub`
JOIN `branches` `b` ON `b`.`branch_id` = `ub`.`branch_id`
WHERE `ub`.`user_id` = '6'
ORDER BY `ub`.`user_branch_id` ASC

        session()->set($sessionData);

        // Update last login
        $userModel->update($user['user_id'], ['last_login' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login` = '2025-12-14 11:45:23', `updated_at` = '2025-12-14 11:45:23'
WHERE `users`.`user_id` IN ('6')