app/Controllers/BranchController.php

SELECT `b`.`branch_id`, `b`.`branch_name`, `b`.`manager_name`, `b`.`address`, `b`.`phone`, `b`.`email`, `b`.`status`
FROM `branches` `b`
---
    public function index()
    {
        $db = db_connect();

        // ✅ No join needed, since manager_name is stored directly in branches
        $branches = $db->table('branches b')
            ->select('b.branch_id, b.branch_name, b.manager_name, b.address, b.phone, b.email, b.status')
            ->get()
            ->getResultArray();