app/Controllers/CentralDashboard.php

    public function index() {
        $role = (string) (session('role') ?? '');
        if (!in_array($role, ['central_admin','system_admin'])) {
            return redirect()->to(site_url('dashboard'));
        }

        try {
            $db = \Config\Database::connect();
            if (!is_object($db)) {
                throw new \Exception('Database connection failed');
            }
        } catch (\Exception $e) {
            log_message('error', 'Database connection error in CentralDashboard: ' . $e->getMessage());
            return redirect()->back()->with('error', 'Database connection error');
        }

        // Initialize data arrays
        $stockValue = 0;
        $lowStock = 0;
        $pendingOrders = 0;
        $pendingOrdersList = [];
        $categoryStats = [];
        $ordersTrend = [];
        $lowStockList = [];
        $totalBranches = 0;
        $totalUsers = 0;
        $totalProducts = 0;

        try {
            // Total Stock Value
            $result = $db->table('inventory i')
                ->select('SUM(i.current_stock * p.unit_price) as total_value')
                ->join('products p', 'p.product_id = i.product_id')
                ->get()
                ->getRowArray();
---
SELECT SUM(i.current_stock * p.unit_price) as total_value
FROM `inventory` `i`
JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`


        try {
            // Low Stock Alerts (uses available_stock vs product minimum)
            $result = $db->table('inventory i')
                ->select('COUNT(*) as low_count')
                ->join('products p', 'p.product_id = i.product_id')
                ->where('i.available_stock <= p.minimum_stock')
                ->get()
                ->getRowArray();
---
SELECT COUNT(*) as low_count
FROM `inventory` `i`
JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
WHERE `i`.`available_stock` <= `p`.`minimum_stock`


        try {
            // Pending Orders
            $pendingOrders = $db->table('purchase_orders')
                ->where('status', 'pending')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `status` = 'pending'


        try {
            // Pending Orders List (latest 5)
            $pendingOrdersList = $db->table('purchase_orders po')
                ->select('po.po_number, po.requested_date, b.branch_name')
                ->join('branches b', 'b.branch_id = po.branch_id', 'left')
                ->where('po.status', 'pending')
                ->orderBy('po.requested_date', 'DESC')
                ->limit(5)
                ->get()
                ->getResultArray();
---
SELECT `po`.`po_number`, `po`.`requested_date`, `b`.`branch_name`
FROM `purchase_orders` `po`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `po`.`branch_id`
WHERE `po`.`status` = 'pending'
ORDER BY `po`.`requested_date` DESC
 LIMIT 5


        try {
            // Stock per category (for Donut Chart)
            $categoryStats = $db->table('inventory i')
                ->select('c.category_name, SUM(i.current_stock) as qty')
                ->join('products p', 'p.product_id = i.product_id')
                ->join('categories c', 'c.category_id = p.category_id')
                ->groupBy('c.category_name')
                ->get()
                ->getResultArray();
---
SELECT `c`.`category_name`, SUM(i.current_stock) as qty
FROM `inventory` `i`
JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
JOIN `categories` `c` ON `c`.`category_id` = `p`.`category_id`
GROUP BY `c`.`category_name`


        try {
            // Orders trend per month (for Line Chart)
            $ordersTrend = $db->table('purchase_orders')
                ->select("MONTH(COALESCE(created_at, requested_date)) as month, COUNT(*) as total")
                ->where('YEAR(COALESCE(created_at, requested_date))', date('Y'))
                ->groupBy('MONTH(COALESCE(created_at, requested_date))')
                ->orderBy('month', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT MONTH(created_at) as month, COUNT(*) as total
FROM `purchase_orders`
WHERE YEAR(created_at) = '2025'
GROUP BY MONTH(created_at)
ORDER BY `month` ASC


        try {
            // Low stock list across branches (top 10)
            $lowStockList = $db->table('inventory i')
                ->select('b.branch_name, p.product_name, i.available_stock, p.minimum_stock')
                ->join('branches b', 'b.branch_id = i.branch_id')
                ->join('products p', 'p.product_id = i.product_id')
                ->where('i.available_stock <= p.minimum_stock')
                ->orderBy('b.branch_name', 'ASC')
                ->orderBy('p.product_name', 'ASC')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `b`.`branch_name`, `p`.`product_name`, `i`.`available_stock`, `p`.`minimum_stock`
FROM `inventory` `i`
JOIN `branches` `b` ON `b`.`branch_id` = `i`.`branch_id`
JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
WHERE `i`.`available_stock` <= `p`.`minimum_stock`
ORDER BY `b`.`branch_name` ASC, `p`.`product_name` ASC
 LIMIT 10

    public function manageUsers() {
        $role = (string) (session('role') ?? '');
        if (!in_array($role, ['central_admin','system_admin'])) {
            return redirect()->to(site_url('dashboard'));
        }

        $userModel = new UserModel();
        $users = $userModel->findAll();
---
SELECT *
FROM `users`