app/Controllers/DeliveryController.php

SELECT `branch_id`
FROM `user_branches`
WHERE `user_id` = 5
---
    public function index()
    {
        $session = session();
        $userId = (int)($session->get('user_id') ?? 0);
        $role = (string)($session->get('role') ?? '');

        if ($role !== 'branch_manager') {
            return redirect()->back()->with('error', 'Unauthorized access');
        }

        $db = db_connect();

        // Setup map coordinates if not already done
        $this->setupMapCoordinates($db);

        $branchId = $db->table('user_branches')
            ->select('branch_id')
            ->where('user_id', $userId)
            ->get()->getRowArray();

UPDATE `branches` SET `latitude` = 7.0731, `longitude` = 125.6121
---
            }

            // Update all branches with Davao coordinates
            $db->table('branches')->update([
                'latitude' => 7.0731,
                'longitude' => 125.6121
            ]);