app/Controllers/FranchiseDashboard.php

SELECT COUNT(*) AS `numrows`
FROM `branches`
WHERE `status` = 'active'
SELECT SUM(i.current_stock * p.unit_price) as total_value
FROM `inventory` `i`
JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `status` = 'pending'
SELECT `b`.`branch_id`, `b`.`branch_name`, COUNT(po.purchase_order_id) as order_count, SUM(i.current_stock * p.unit_price) as inventory_value
FROM `branches` `b`
LEFT JOIN `purchase_orders` `po` ON `po`.`branch_id` = `b`.`branch_id`
LEFT JOIN `inventory` `i` ON `i`.`branch_id` = `b`.`branch_id`
LEFT JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
WHERE `b`.`status` = 'active'
GROUP BY `b`.`branch_id`, `b`.`branch_name`
SELECT `c`.`category_name`, SUM(i.current_stock) as qty, SUM(i.current_stock * p.unit_price) as value
FROM `inventory` `i`
JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
JOIN `categories` `c` ON `c`.`category_id` = `p`.`category_id`
GROUP BY `c`.`category_name`
SELECT `po`.`po_number`, `po`.`status`, `po`.`requested_date`, `b`.`branch_name`, `s`.`supplier_name`
FROM `purchase_orders` `po`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `po`.`branch_id`
LEFT JOIN `suppliers` `s` ON `s`.`supplier_id` = `po`.`supplier_id`
ORDER BY `po`.`created_at` DESC
 LIMIT 10
---
    public function index()
    {
        $role = (string) (session('role') ?? '');
        if ($role !== 'franchise_manager') {
            return redirect()->to(site_url('dashboard'));
        }

        try {
            $db = \Config\Database::connect();

            $totalBranches = $db->table('branches')
                ->where('status', 'active')
                ->countAllResults();

            $totalInventoryValue = $db->table('inventory i')
                ->select('SUM(i.current_stock * p.unit_price) as total_value')
                ->join('products p', 'p.product_id = i.product_id')
                ->get()
                ->getRowArray();

            $totalOrders = $db->table('purchase_orders')
                ->countAllResults();

            $pendingOrders = $db->table('purchase_orders')
                ->where('status', 'pending')
                ->countAllResults();

            $branchPerformance = $db->table('branches b')
                ->select('b.branch_id, b.branch_name, COUNT(po.purchase_order_id) as order_count, SUM(i.current_stock * p.unit_price) as inventory_value')
                ->join('purchase_orders po', 'po.branch_id = b.branch_id', 'left')
                ->join('inventory i', 'i.branch_id = b.branch_id', 'left')
                ->join('products p', 'p.product_id = i.product_id', 'left')
                ->where('b.status', 'active')
                ->groupBy('b.branch_id, b.branch_name')
                ->get()
                ->getResultArray();

            $categoryDistribution = $db->table('inventory i')
                ->select('c.category_name, SUM(i.current_stock) as qty, SUM(i.current_stock * p.unit_price) as value')
                ->join('products p', 'p.product_id = i.product_id')
                ->join('categories c', 'c.category_id = p.category_id')
                ->groupBy('c.category_name')
                ->get()
                ->getResultArray();

            $recentOrders = $db->table('purchase_orders po')
                ->select('po.po_number, po.status, po.requested_date, b.branch_name, s.supplier_name')
                ->join('branches b', 'b.branch_id = po.branch_id', 'left')
                ->join('suppliers s', 's.supplier_id = po.supplier_id', 'left')
                ->orderBy('po.created_at', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();