app/Controllers/InventoryController.php

private function getAggregatedInventoryView($db, $allBranches, $isStaffView = false, $activeState = 'inventory')
    {
        // Make sure we have a valid database connection
        if (!is_object($db)) {
            $db = \Config\Database::connect();
        }
        // Aggregated view for staff across all branches
        $lowStockItems = $db->table('inventory i')
            ->select('b.branch_name, p.product_name, i.available_stock, p.minimum_stock')
            ->join('products p', 'p.product_id = i.product_id', 'left')
            ->join('branches b', 'b.branch_id = i.branch_id', 'left')
            ->where('i.available_stock <= p.minimum_stock')
            ->orderBy('b.branch_name', 'ASC')
            ->orderBy('p.product_name', 'ASC')
            ->get()
            ->getResultArray();

        $pendingReceives = $db->table('purchase_orders po')
            ->select('po.purchase_order_id, po.po_number, po.status, po.expected_delivery_date, s.supplier_name')
            ->join('suppliers s', 's.supplier_id = po.supplier_id', 'left')
            ->whereIn('po.status', ['approved','ordered'])
            ->orderBy('po.expected_delivery_date', 'ASC')
            ->limit(10)
            ->get()
            ->getResultArray();

        // Get all products with aggregated inventory
        $branchInventory = $db->table('products p')
            ->select('p.product_id, p.product_name, p.unit_price, p.minimum_stock,
                     COALESCE(SUM(i.current_stock), 0) as current_stock,
                     COALESCE(SUM(i.available_stock), 0) as available_stock,
                     (COALESCE(SUM(i.current_stock * p.unit_price), 0)) as stock_value')
            ->join('inventory i', 'i.product_id = p.product_id', 'left')
            ->groupBy('p.product_id')
            ->orderBy('p.product_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `i`.`inventory_id`, `b`.`branch_name`, `p`.`product_name`, `i`.`current_stock`, `p`.`unit_price`, (i.current_stock * p.unit_price) as stock_value
FROM `inventory` `i`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `i`.`branch_id`
LEFT JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
ORDER BY `b`.`branch_name` ASC

    public function dashboard()
    {
        // Dashboard view for inventory_staff - shows summary and overview for ALL BRANCHES
        $session = session();
        if (!$session->has('role') || !$session->has('user_id')) {
            return redirect()->to(site_url('login'))->with('error', 'Please login first');
        }

        $userRole = $session->get('role');
        $userId = $session->get('user_id');

        // For non-inventory staff, redirect to the main inventory page
        if ($userRole !== 'inventory_staff') {
            return redirect()->to(site_url('inventory'));
        }

        try {
            $db = \Config\Database::connect();

            // Get all branches for inventory staff
            $allBranches = $db->table('branches')
                ->select('branch_id, branch_name')
                ->where('status', 'active')
                ->orderBy('branch_name', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `branch_id`, `branch_name`
FROM `branches`
WHERE `status` = 'active'
ORDER BY `branch_name` ASC

            // If filtering by specific branch, ensure all products are shown
            if ($branchFilter) {
                $existingProductIds = array_column($inventory, 'product_id');
                $allProducts = $db->table('products')
                    ->select('product_id, product_name, unit_price, minimum_stock')
                    ->where('status', 'active')
                    ->whereNotIn('product_id', $existingProductIds ?: [0])
                    ->get()
                    ->getResultArray();
---
SELECT `product_id`, `product_name`, `unit_price`, `minimum_stock`
FROM `products`
WHERE `status` = 'active'
AND `product_id` NOT IN ('6','7','9','8','1')

                // For central admin, system admin, franchise manager or when viewing all branches
                if ($requestedAll || $userRole === 'central_admin' || $userRole === 'system_admin' || $userRole === 'franchise_manager') {
                    // Aggregated view for staff across all branches, but keep the same dashboard UI
                    $lowStockItems = $db->table('inventory i')
                        ->select('b.branch_name, p.product_name, i.available_stock, p.minimum_stock')
                        ->join('products p', 'p.product_id = i.product_id', 'left')
                        ->join('branches b', 'b.branch_id = i.branch_id', 'left')
                        ->where('i.available_stock <= p.minimum_stock')
                        ->orderBy('b.branch_name', 'ASC')
                        ->orderBy('p.product_name', 'ASC')
                        ->get()->getResultArray();

                    $pendingReceives = $db->table('purchase_orders po')
                        ->select('po.purchase_order_id, po.po_number, po.status, po.expected_delivery_date, s.supplier_name as supplier_name')
                        ->join('suppliers s', 's.supplier_id = po.supplier_id', 'left')
                        ->whereIn('po.status', ['approved','ordered'])
                        ->orderBy('po.expected_delivery_date', 'ASC')
                        ->limit(10)
                        ->get()->getResultArray();

                    // Aggregated branchInventory by product across all branches
                    $branchInventory = $db->table('inventory i')
                        ->select('p.product_id, p.product_name, SUM(i.current_stock) as current_stock, SUM(i.available_stock) as available_stock, p.unit_price, SUM(i.current_stock * p.unit_price) as stock_value, p.minimum_stock')
                        ->join('products p', 'p.product_id = i.product_id', 'left')
                        ->groupBy('p.product_id')
                        ->orderBy('p.product_name', 'ASC')
                        ->get()->getResultArray();

                    $products = $db->table('products')
                        ->select('product_id, product_name, unit_price, minimum_stock')
                        ->orderBy('product_name', 'ASC')
                        ->get()->getResultArray();
---
SELECT `b`.`branch_name`, `p`.`product_name`, `i`.`available_stock`, `p`.`minimum_stock`
FROM `inventory` `i`
LEFT JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `i`.`branch_id`
WHERE `i`.`available_stock` <= `p`.`minimum_stock`
ORDER BY `b`.`branch_name` ASC, `p`.`product_name` ASC
SELECT `po`.`purchase_order_id`, `po`.`po_number`, `po`.`status`, `po`.`expected_delivery_date`, `s`.`supplier_name` as `supplier_name`
FROM `purchase_orders` `po`
LEFT JOIN `suppliers` `s` ON `s`.`supplier_id` = `po`.`supplier_id`
WHERE `po`.`status` IN ('approved','ordered')
ORDER BY `po`.`expected_delivery_date` ASC
 LIMIT 10
SELECT `p`.`product_id`, `p`.`product_name`, SUM(i.current_stock) as current_stock, SUM(i.available_stock) as available_stock, `p`.`unit_price`, SUM(i.current_stock * p.unit_price) as stock_value, `p`.`minimum_stock`
FROM `inventory` `i`
LEFT JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
GROUP BY `p`.`product_id`
ORDER BY `p`.`product_name` ASC
SELECT `product_id`, `product_name`, `unit_price`, `minimum_stock`
FROM `products`
ORDER BY `product_name` ASC

            }

            $builder->where('i.branch_id', $branchId);
            $branchMeta = $db->table('branches')->select('branch_name')->where('branch_id', $branchId)->get()->getRowArray();
            $canSwitch = in_array($userRole, ['central_admin','system_admin','inventory_staff','franchise_manager']);
            $allBranches = $canSwitch
                ? $db->table('branches')->select('branch_id, branch_name')->orderBy('branch_name','ASC')->get()->getResultArray()
                : [];

            // Low stock list for this branch
            $lowStockItems = $db->table('inventory i')
                ->select('p.product_name, i.available_stock, b.branch_name')
                ->join('products p', 'p.product_id = i.product_id', 'left')
                ->join('branches b', 'b.branch_id = i.branch_id', 'left')
                ->where('i.branch_id', $branchId)
                ->where('i.available_stock <= p.minimum_stock')
                ->orderBy('p.product_name', 'ASC')
                ->get()
                ->getResultArray();

            // Pending receives (approved or ordered) for this branch
            $pendingReceives = $db->table('purchase_orders po')
                ->select('po.purchase_order_id, po.po_number, po.status, po.expected_delivery_date, s.supplier_name as supplier_name')
                ->join('suppliers s', 's.supplier_id = po.supplier_id', 'left')
                ->where('po.branch_id', $branchId)
                ->whereIn('po.status', ['approved','ordered'])
                ->orderBy('po.expected_delivery_date', 'ASC')
                ->limit(10)
                ->get()
                ->getResultArray();

            // Products for adjust dropdown (also used for fallback rows)
            $products = $db->table('products')
                ->select('product_id, product_name, unit_price, minimum_stock')
                ->orderBy('product_name', 'ASC')
                ->get()
                ->getResultArray();

            // My branch inventory (real-time view) – show ALL products, including zero stock
            $branchInventory = $db->table('products p')
                ->select('p.product_id, p.product_name, COALESCE(i.current_stock,0) as current_stock, COALESCE(i.available_stock,0) as available_stock, p.unit_price, (COALESCE(i.current_stock,0) * p.unit_price) as stock_value, p.minimum_stock')
                ->join('inventory i', 'i.product_id = p.product_id AND i.branch_id = '.(int)$branchId, 'left')
                ->where('p.status', 'active')
                ->orderBy('p.product_name', 'ASC')
                ->get()->getResultArray();
---
SELECT `branch_name`
FROM `branches`
WHERE `branch_id` = 1
SELECT `branch_id`, `branch_name`
FROM `branches`
ORDER BY `branch_name` ASC
SELECT `p`.`product_name`, `i`.`available_stock`, `b`.`branch_name`
FROM `inventory` `i`
LEFT JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `i`.`branch_id`
WHERE `i`.`branch_id` = 1
AND `i`.`available_stock` <= `p`.`minimum_stock`
ORDER BY `p`.`product_name` ASC
SELECT `po`.`purchase_order_id`, `po`.`po_number`, `po`.`status`, `po`.`expected_delivery_date`, `s`.`supplier_name` as `supplier_name`
FROM `purchase_orders` `po`
LEFT JOIN `suppliers` `s` ON `s`.`supplier_id` = `po`.`supplier_id`
WHERE `po`.`branch_id` = 1
AND `po`.`status` IN ('approved','ordered')
ORDER BY `po`.`expected_delivery_date` ASC
 LIMIT 10
SELECT `product_id`, `product_name`, `unit_price`, `minimum_stock`
FROM `products`
ORDER BY `product_name` ASC
SELECT `p`.`product_id`, `p`.`product_name`, COALESCE(i.current_stock, 0) as current_stock, COALESCE(i.available_stock, 0) as available_stock, `p`.`unit_price`, (COALESCE(i.current_stock, 0) * p.unit_price) as stock_value, `p`.`minimum_stock`
FROM `products` `p`
LEFT JOIN `inventory` `i` ON `i`.`product_id` = `p`.`product_id` AND `i`.`branch_id` = 1
WHERE `p`.`status` = 'active'
ORDER BY `p`.`product_name` ASC