app/Controllers/InventoryController.php

SELECT `branch_name`
FROM `branches`
WHERE `branch_id` = 1
SELECT `branch_id`, `branch_name`
FROM `branches`
ORDER BY `branch_name` ASC
SELECT `p`.`product_name`, `i`.`available_stock`, `b`.`branch_name`
FROM `inventory` `i`
LEFT JOIN `products` `p` ON `p`.`product_id` = `i`.`product_id`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `i`.`branch_id`
WHERE `i`.`branch_id` = 1
AND `i`.`available_stock` <= `p`.`minimum_stock`
ORDER BY `p`.`product_name` ASC
SELECT `po`.`purchase_order_id`, `po`.`po_number`, `po`.`status`, `po`.`expected_delivery_date`, `s`.`supplier_name` as `supplier_name`
FROM `purchase_orders` `po`
LEFT JOIN `suppliers` `s` ON `s`.`supplier_id` = `po`.`supplier_id`
WHERE `po`.`branch_id` = 1
AND `po`.`status` IN ('approved','ordered')
ORDER BY `po`.`expected_delivery_date` ASC
 LIMIT 10
SELECT `product_id`, `product_name`, `unit_price`, `minimum_stock`
FROM `products`
ORDER BY `product_name` ASC
SELECT `p`.`product_name`, COALESCE(i.current_stock, 0) as current_stock, COALESCE(i.available_stock, 0) as available_stock, `p`.`unit_price`, (COALESCE(i.current_stock, 0) * p.unit_price) as stock_value, `p`.`minimum_stock`
FROM `products` `p`
LEFT JOIN `inventory` `i` ON `i`.`product_id` = `p`.`product_id` AND `i`.`branch_id` = 1
ORDER BY `p`.`product_name` ASC
---
            }

            $builder->where('i.branch_id', $branchId);
            $branchMeta = $db->table('branches')->select('branch_name')->where('branch_id', $branchId)->get()->getRowArray();
            $canSwitch = in_array($userRole, ['central_admin','system_admin','inventory_staff']);
            $allBranches = $canSwitch
                ? $db->table('branches')->select('branch_id, branch_name')->orderBy('branch_name','ASC')->get()->getResultArray()
                : [];

            // Low stock list for this branch
            $lowStockItems = $db->table('inventory i')
                ->select('p.product_name, i.available_stock, b.branch_name')
                ->join('products p', 'p.product_id = i.product_id', 'left')
                ->join('branches b', 'b.branch_id = i.branch_id', 'left')
                ->where('i.branch_id', $branchId)
                ->where('i.available_stock <= p.minimum_stock')
                ->orderBy('p.product_name', 'ASC')
                ->get()
                ->getResultArray();

            // Pending receives (approved or ordered) for this branch
            $pendingReceives = $db->table('purchase_orders po')
                ->select('po.purchase_order_id, po.po_number, po.status, po.expected_delivery_date, s.supplier_name as supplier_name')
                ->join('suppliers s', 's.supplier_id = po.supplier_id', 'left')
                ->where('po.branch_id', $branchId)
                ->whereIn('po.status', ['approved','ordered'])
                ->orderBy('po.expected_delivery_date', 'ASC')
                ->limit(10)
                ->get()
                ->getResultArray();

            // Products for adjust dropdown (also used for fallback rows)
            $products = $db->table('products')
                ->select('product_id, product_name, unit_price, minimum_stock')
                ->orderBy('product_name', 'ASC')
                ->get()
                ->getResultArray();

            // My branch inventory (real-time view) – show ALL products, including zero stock
            $branchInventory = $db->table('products p')
                ->select('p.product_name, COALESCE(i.current_stock,0) as current_stock, COALESCE(i.available_stock,0) as available_stock, p.unit_price, (COALESCE(i.current_stock,0) * p.unit_price) as stock_value, p.minimum_stock')
                ->join('inventory i', 'i.product_id = p.product_id AND i.branch_id = '.(int)$branchId, 'left')
                ->orderBy('p.product_name', 'ASC')
                ->get()->getResultArray();