app/Controllers/LogisticsDashboard.php

    public function index()
    {
        if ($redirect = $this->checkLogisticsRole()) {
            return $redirect;
        }

        try {
            // Get statistics from purchase_orders
            $totalShipments = $this->db->table('purchase_orders')
                ->whereIn('status', ['approved', 'ordered', 'delivered'])
                ->countAllResults();

            $pendingDeliveries = $this->db->table('purchase_orders')
                ->whereIn('status', ['approved', 'ordered'])
                ->countAllResults();

            $deliveredThisMonth = $this->db->table('purchase_orders')
                ->where('status', 'delivered')
                ->where('MONTH(actual_delivery_date)', date('m'))
                ->where('YEAR(actual_delivery_date)', date('Y'))
                ->countAllResults();

            // Get recent shipments with branch and supplier info
            $recentShipments = $this->db->table('purchase_orders po')
                ->select('po.*, b.branch_name, s.supplier_name')
                ->join('branches b', 'b.branch_id = po.branch_id', 'left')
                ->join('suppliers s', 's.supplier_id = po.supplier_id', 'left')
                ->whereIn('po.status', ['approved', 'ordered', 'delivered'])
                ->orderBy('po.created_at', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();

            // Get status distribution for chart
            $statusDistribution = $this->db->table('purchase_orders')
                ->select('status, COUNT(*) as count')
                ->whereIn('status', ['approved', 'ordered', 'delivered'])
                ->groupBy('status')
                ->get()
                ->getResultArray();

            // Get route efficiency (orders by branch)
            $routeEfficiency = $this->db->table('purchase_orders po')
                ->select('b.branch_name, COUNT(*) as order_count')
                ->join('branches b', 'b.branch_id = po.branch_id', 'left')
                ->whereIn('po.status', ['approved', 'ordered', 'delivered'])
                ->groupBy('b.branch_name')
                ->orderBy('order_count', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `status` IN ('approved','ordered','delivered')
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `status` IN ('approved','ordered')
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`
WHERE `status` = 'delivered'
AND MONTH(actual_delivery_date) = '12'
AND YEAR(actual_delivery_date) = '2025'
SELECT `po`.*, `b`.`branch_name`, `s`.`supplier_name`
FROM `purchase_orders` `po`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `po`.`branch_id`
LEFT JOIN `suppliers` `s` ON `s`.`supplier_id` = `po`.`supplier_id`
WHERE `po`.`status` IN ('approved','ordered','delivered')
ORDER BY `po`.`created_at` DESC
 LIMIT 10
SELECT `status`, COUNT(*) as count
FROM `purchase_orders`
WHERE `status` IN ('approved','ordered','delivered')
GROUP BY `status`
SELECT `b`.`branch_name`, COUNT(*) as order_count
FROM `purchase_orders` `po`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `po`.`branch_id`
WHERE `po`.`status` IN ('approved','ordered','delivered')
GROUP BY `b`.`branch_name`
ORDER BY `order_count` DESC
 LIMIT 10