app/Controllers/OrderController.php

    public function index()
    {
        $db = db_connect();

        $builder = $db->table('purchase_orders po')
            ->select('po.purchase_order_id, po.po_number, po.status, po.total_amount, po.requested_date, po.created_at, b.branch_name')
            ->join('branches b', 'b.branch_id = po.branch_id', 'left');

        // Role-based scoping: staff and branch managers only see their branch
        $role = (string)(session('role') ?? '');
        $userId = (int)(session('user_id') ?? 0);
        if (in_array($role, ['inventory_staff','branch_manager'])) {
            $branch = $db->table('user_branches')
                ->select('branch_id')
                ->where('user_id', $userId)
                ->orderBy('user_branch_id', 'ASC')
                ->get()->getRowArray();
            if ($branch && isset($branch['branch_id'])) {
                $builder->where('po.branch_id', (int)$branch['branch_id']);
            } else {
                // If no branch, return empty
                return view('dashboard/orders', ['orders' => []]);
            }
        }

        $orders = $builder->orderBy('po.created_at', 'DESC')->get()->getResultArray();

        // Add product names for each purchase order
        foreach ($orders as &$order) {
            $items = $db->table('purchase_order_items poi')
                ->select('p.product_name')
                ->join('products p', 'p.product_id = poi.product_id', 'left')
                ->where('poi.purchase_order_id', $order['purchase_order_id'])
                ->get()
                ->getResultArray();
---
SELECT `po`.`purchase_order_id`, `po`.`po_number`, `po`.`status`, `po`.`total_amount`, `po`.`requested_date`, `po`.`created_at`, `b`.`branch_name`
FROM `purchase_orders` `po`
LEFT JOIN `branches` `b` ON `b`.`branch_id` = `po`.`branch_id`
ORDER BY `po`.`created_at` DESC
SELECT `p`.`product_name`
FROM `purchase_order_items` `poi`
LEFT JOIN `products` `p` ON `p`.`product_id` = `poi`.`product_id`
WHERE `poi`.`purchase_order_id` = '33'