app/Controllers/ReportsController.php

    public function index()
    {
        $role = (string)(session('role') ?? '');
        if (empty($role)) {
            return redirect()->to(site_url('login'));
        }

        $data = [
            'title' => 'Reports',
            'active' => 'reports',
            'branches' => []
        ];

        // Get all branches for central admins
        if (in_array($role, ['central_admin', 'system_admin'])) {
            $db = \Config\Database::connect();
            $data['branches'] = $db->table('branches')
                ->select('branch_id, branch_name')
                ->where('status', 'active')
                ->orderBy('branch_name', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `branch_id`, `branch_name`
FROM `branches`
WHERE `status` = 'active'
ORDER BY `branch_name` ASC