app/Controllers/SupplierController.php

            'updated_at' => date('Y-m-d H:i:s')
        ];

        if ($this->supplierModel->update($id, $data)) {
---
UPDATE `suppliers` SET `supplier_name` = 'Dairy & Frozen Foods Co.', `contact_person` = 'Mark Lu', `phone` = '+63 82 555-6666', `email` = 'Mark@dairyfrozen.com', `address` = '987 Cold Storage Complex, Davao City, Philippines', `payment_terms` = 'Net 30', `delivery_time` = '2', `status` = 'active'
WHERE `suppliers`.`supplier_id` IN ('5')